{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.6/4.0"
      ],
      "degree": "Bachelor of Technology",
      "department": " Computer Science",
      "duration": "2006-2011",
      "school_name": "Visvesvaraya Technological University"
    },
    {
      "awards_achievements": [
        "GPA: 3.8/4.0"
      ],
      "degree": "Post Graduate Diploma/ Associate Degree",
      "department": "Business Analysis",
      "duration": "2021-2022",
      "school_name": "Conestoga College of Advanced Learning and Technology"
    },
    {
      "awards_achievements": [
        "GPA: 3.73/4.0"
      ],
      "degree": "Post Graduate Diploma/ Associate Degree",
      "department": "Project Management",
      "duration": "January 2021 to November 2021",
      "school_name": "Conestoga College of Advanced Learning and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-vikrantsharmaJAR",
  "highlighted_projects": [
    {
      "description": "WAAW is a cutting-edge hiring solution project consisting of two modules. Its primary objective is to provide a comprehensive platform that facilitates effective communication and hiring for job seekers and employers. The first module enables employers to post job opportunities, create projects, and leverage service integration for extracting user profile information. The second module offers an integrated platform for employers to manage employee shifts, schedules, break times, and handle payroll and overtime. WAAW cloud platform provides a complete suite of features, empowering employers and employees to collaborate and work flexibly from anywhere, at any time. The MVP 1 for this project has been released and can be viewed on `www.waaw.ca`.",
      "name": "WAAW (Work Anytime, Any Where), Work Scheduler"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux cluster Administration team developed a solution to monitor and manage a cluster of 10 servers. This application allows server users to retrieve and monitor server hardware specifications and usage information by using two bash scripts. The data is collected and stored in a PostgreSQL database for scalability and data security. Technologies used include Linux CLI, Git for version control, Docker for consistent development(psql_docker), bash scripting(host and usage) to retrieve hardware and usage data,  PostgreSQL(server) Alpine version 9.6 for data storage and psql CLI Client tool to create tables(sql/ddl.sql) in server to store data.The Crontab tool schedules the script to run every minute, facilitating the collection of server usage data The solution improves server cluster stability and productivity, enabling streamlined operations and maintenance.",
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-vikrantsharmaJAR",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Vikrant Sharma",
  "others": [
    {
      "bullets": [
        "Certified Scrum Master from Scrum Alliance valid till 2025",
        "Enter Certificate in Business Analysis from IIBA",
        "Scaled Agile Framework Expert(SAFe 6.0) certified from Scaled Agile Inc"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Competitive gaming; Played Cricket and represented state in Government sponsored cricket tournament",
        "Passionate about Astro-photography, got recognised for the picture of Orion star cluster that was published in Local Magazine ",
        "Meditation: Passionate and have been teaching meditation from last 2 years",
        "Actively volunteered at Khelo India, dedicating my efforts to promote and raise awareness about sports among women in India"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Assisted product owner in maintaining the product backlog, translated specifications into user stories, and participate in the development of BRD/FRD. Performed UML modeling to generate use cases and activity process flow diagrams to depict system functionalities visually. Collaboration is facilitated by JAD sessions for requirement elicitation. Conducted risk analysis for risk mitigation. Defined and implemented change management process to effectively manage changing requirements. Implemented and facilitated Agile/Scrum throughout the Product development lifecycle. Based on Technical expertise in technologies like Linux,GCP,RDBMS, Git, and SQL provided process improvement recommendations play a part in successful implementation of project as well as organisational goals.",
      "duration": "June 2023-present",
      "title": "Business System Analyst"
    },
    {
      "company": "VPS Solutions",
      "description": "Participated and successfully implemented business/ IT process mapping and improvements, resulting in increased efficiency and cost savings. I addressed and resolved more than 50 high-priority backlog items, ensuring timely resolution. Through in-depth analysis of 70+ business requests, I emphasized interconnectedness and documented the anticipated impact of future development on systems, processes, procedures, and clients. Additionally, I conducted 30+ requirements interviews and workshops, leading to well-defined user requirements and user stories. Proficient in Agile Scrum, I led daily Scrums, Sprint planning, and Retrospective meetings. I also facilitated 50+ Joint Application Development (JAD) sessions with stakeholders and business partners.",
      "duration": "January 2022 to June 2023",
      "title": "Business Analyst"
    },
    {
      "company": "Inert IT Private Limited",
      "description": "Successfully delivered web-based applications for clients of various domains like Healthcare, education and finance. I excel in requirements gathering and stakeholder management, resulting in a 20% increase in development efficiency and 15% reduction in rework. Assisted in developement and maintaince of product backlog for 4 projects. Acted as a bridge between clients and the development team, ensuring effective communication and collaboration. Worked closely with subject matter experts to gather insights and expertise, resulting in comprehensive and innovative solutions, which lead to 20% revenue increase.",
      "duration": "July 2019 to July 2021",
      "title": "Business analyst"
    },
    {
      "company": "CompuCom",
      "description": "Utilized leveraging tools such as MS Project, Visio, and SharePoint, I achieved increase in project planning efficiency, reducing documentation time by 20%. Created Project Schedules and managed project resources in Microsoft project. Tracked project progress and generated progress reports at regular intervals to present to stakeholders to keep them updated. Utilized JIRA for internal team communication and ticketing  ensured timely project completion, reducing project delays by 25%. Facilitating project meetings fostered effective communication, resulting in increase in team alignment and collaboration. Utilizing Confluence, I streamline project documentation, leading to a 15% improvement in progress tracking and lead to successfull project delivery.",
      "duration": "April 2016 to April 2017",
      "title": "IT Project Coordinator"
    },
    {
      "company": "HCLTech",
      "description": "As a manual tester at HCLTech, I have successfully managed test cases, define test requirements, track test execution progress, and report on test results using HP Quality center. It enables collaboration among team members, allowing them to share test artifacts, track changes, and communicate effectively. Written test cases for multiple projects and logged bugs using bug tracking tools like Bugzilla and Jira. With my meticulous approach, I have consistently ensured high-quality software by identifying and reporting defects effectively.",
      "duration": "September 2011 to September 2014",
      "title": "Test Engineer (Manual)"
    }
  ],
  "skills": {
    "Business Skills": [
      "Requirement Elicitation",
      "Team Collaboration",
      "Communication",
      "BRD/FRD",
      "User Stories",
      "ALM tools (JIRA, ASANA)",
      "Communication Tools(MS Team, ZOOM, SLACK)",
      "Confluence",
      "UML Modelling",
      "BPMN",
      "Requirement Traceability Matrix",
      "Use Case",
      "Process Mapping",
      "Process Improvement",
      "Facilitation"
    ],
    "Technical Skills": [
      "DBMS(MS SQL Server, My SQL, PostgreSQL)",
      "Data Modeling/Mapping",
      "Data Analytics",
      "Visio",
      "Lucid Charts",
      "GitHub",
      "Linux",
      "Google Cloud Platform",
      "Sharepoint",
      "Microsoft Project",
      "SDLC",
      "Agile/Scrum",
      "Waterfall methodologies"
    ]
  },
  "summary": "Results-driven Business Analyst with 3+ years of experience driving process improvements, analyzing business needs, and delivering strategic solutions. Proven track record of leading cross-functional teams, conducting thorough data analysis, and implementing innovative strategies. Skilled in requirements gathering, stakeholder management, and facilitating effective communication across technical and non-technical stakeholders. Committed to delivering high-quality results within timelines and budgets to foster business growth. Moreover, I possess a comprehensive 4-year background in Project Management, offering invaluable expertise in supporting diverse web applications."
}
